Documents/НормыРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>НормыРасхода</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НормыРасхода</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтароеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НормыРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НормыРасхода</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НормыРасхода/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Функция ПродукцияПриИзмененииНаСервере(ДатаДок, ПродДок)
	Запрос = Новый Запрос;
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	НормыРасходаСрезПоследних.Продукция КАК Продукция,
	|	НормыРасходаСрезПоследних.Материал КАК Материал,
	|	НормыРасходаСрезПоследних.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.НормыРасхода.СрезПоследних(&ДатаДок) КАК НормыРасходаСрезПоследних
	|ГДЕ
	|	НормыРасходаСрезПоследних.Продукция = &ПродДок
	|СГРУППИРОВАТЬ ПО
	|	НормыРасходаСрезПоследних.Продукция,
	|	НормыРасходаСрезПоследних.Материал,
	|	НормыРасходаСрезПоследних.Количество";
	
	Запрос.УстановитьПараметр("ПродДок", ПродДок);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	МассивВозврата = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		СтруктураВозврата=Новый Структура;
		СтруктураВозврата.Вставить("Материал", Выборка.Материал);
		СтруктураВозврата.Вставить("Количество",Выборка.Количество);
		
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	Объект.Материалы.Очистить();
	НС = ПродукцияПриИзмененииНаСервере(Объект.Дата, Объект.Продукция);
	Для Каждого ЭлементМассива Из НС Цикл 
		Если ЭлементМассива.Количество <> 0 Тогда
			СтрМат = Объект.Материалы.Добавить();
			СтрМат.СтароеКоличество = ЭлементМассива.Количество;
			СтрМат.НовоеКоличество = ЭлементМассива.Количество;
			СтрМат.Материал = ЭлементМассива.Материал;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
